public class Main {
  public static void main(String[] args) {

    int amount = 15324;
    int mile = 1 / 20;

    long bonus = amount * mile;

    System.out.println("Итоговый бонус:" + bonus);

    // Объявляете переменные для входных данных и
    // параметров программы: одну для хранения
    // стоимости билета, другую для хранения количества
    // рублей для одной бонусной мили

    // Рассчитываете количество бонусных миль, используя
    // значения заведённых переменных. Ответ сохраняете в
    // новую переменную и выводите на экран
  }
}